## Categorical Missing data handling

# Introduction

In this project, we aim to explore various techniques for handling missing categorical data. Dealing with missing data is a critical step in the data preprocessing pipeline, as it ensures the integrity and quality of the dataset, which ultimately improves the performance of machine learning models.

For this analysis, we have utilized two powerful libraries: **pandas** and **numpy**. These libraries provide essential tools and functions for data manipulation and numerical computations, making the data handling process efficient and straightforward.

## Key Techniques:

1. **Frequent Category Imputation**:
   This technique involves replacing missing categorical values with the most frequent category within the feature. It is a simple yet effective method to address missing data, especially when the missing values are relatively few.

2. **One-Hot Encoding**:
   One-hot encoding is a method of converting categorical variables into a binary format that can be provided to machine learning algorithms. Each unique category is transformed into a separate binary column, indicating the presence (1) or absence (0) of the category.

## Objective:
The primary objective of this project is to demonstrate multiple ways of handling categorical missing data, focusing on frequent category imputation and one-hot encoding. By applying these techniques, we aim to create a robust and clean dataset that is ready for further analysis and model training.

We will use three different datasets to showcase these techniques effectively.

datasets used will be available in the github repo.

In [42]:
import pandas as pd
import numpy as np

In [43]:
df = pd.read_csv('Housing.csv', usecols = ['BsmtQual', 'FireplaceQu','GarageType','SalePrice'])

In [44]:
df.head()

  BsmtQual FireplaceQu GarageType  SalePrice
0       Gd         NaN     Attchd     208500
1       Gd          TA     Attchd     181500
2       Gd          TA     Attchd     223500
3       TA          Gd     Detchd     140000
4       Gd          TA     Attchd     250000

In [45]:
df.isnull().sum()

BsmtQual        37
FireplaceQu    690
GarageType      81
SalePrice        0
dtype: int64

#### Compute the frequency  with every feature

In [46]:
df.groupby(['BsmtQual'])['BsmtQual'].count()

BsmtQual
Ex    121
Fa     35
Gd    618
TA    649
Name: BsmtQual, dtype: int64

In [47]:
df.groupby(['GarageType'])['GarageType'].count()

GarageType
2Types       6
Attchd     870
Basment     19
BuiltIn     88
CarPort      9
Detchd     387
Name: GarageType, dtype: int64

In [48]:
df.groupby(['FireplaceQu'])['FireplaceQu'].count()

FireplaceQu
Ex     24
Fa     33
Gd    380
Po     20
TA    313
Name: FireplaceQu, dtype: int64

### Frequent Category Imputation
The idea behind this technique is to impute the NAN values with the most frequent values. However we must note that it may over represent the most frequent value in case of many NAN.

In [49]:
def impute_nan(df, variable):
    most_frequent = df[variable].value_counts().index[0]
    df[variable].fillna(most_frequent, inplace = True)

In [ ]:
for features in ['BsmtQual', 'FireplaceQu','GarageType','SalePrice']:
    impute_nan(df, features)

In [51]:
df.isnull().mean()

BsmtQual       0.0
FireplaceQu    0.0
GarageType     0.0
SalePrice      0.0
dtype: float64

#### Adding a variable to capture NAN
It helps when there are lot of NAN, however it increases the dimensions of the datasets.

In [ ]:
df = pd.read_csv('Housing.csv', usecols = ['BsmtQual', 'FireplaceQu','GarageType','SalePrice'])

df['Bsmt_var'] = np.where(df['BsmtQual'].isnull(),1,0)
df['Fireplace_var'] = np.where(df['FireplaceQu'].isnull(),1,0)

frequent = df['FireplaceQu'].mode(0)
df['FireplaceQu'].fillna(frequent, inplace = True)

frequent = df['BsmtQual'].mode(0)
df['BsmtQual'].fillna(frequent, inplace = True)

In [59]:
df.head()

  BsmtQual FireplaceQu GarageType  SalePrice  Bsmt_var  Fireplace_var
0       Gd         NaN     Attchd     208500         0              1
1       Gd          TA     Attchd     181500         0              0
2       Gd          TA     Attchd     223500         0              0
3       TA          Gd     Detchd     140000         0              0
4       Gd          TA     Attchd     250000         0              0

## Handle Categorical Features

### 1. One Hot Encoding

In [61]:
import pandas as pd
import numpy as np

In [62]:
df = pd.read_csv('titanic.csv', usecols = ['Sex'])

In [63]:
df.head()

      Sex
0    male
1  female
2  female
3  female
4    male

In [66]:
pd.get_dummies(df, dtype = int, drop_first = True).head()

   Sex_male
0         1
1         0
2         0
3         0
4         1

In [67]:
df = pd.read_csv('titanic.csv', usecols = ['Embarked'])

In [71]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [ ]:
frequent = df['Embarked'].mode(0)
df['Embarked'].fillna(frequent, inplace = True)

In [75]:
pd.get_dummies(df, dtype =  int, drop_first = True).head()

   Embarked_Q  Embarked_S
0           0           1
1           0           0
2           0           1
3           0           1
4           0           1

### One Hot Encoding in case of many categories in a feature

In [80]:
df = pd.read_csv("Mercedes.csv", usecols = ["X0", "X1", "X2", "X3", "X4"])

In [82]:
df.head()

   X0 X1  X2 X3 X4
0   k  v  at  a  d
1   k  t  av  e  d
2  az  w   n  c  d
3  az  t   n  f  d
4  az  v   n  f  d

In [96]:
df['X0'].value_counts()

X0
z     360
ak    349
y     324
ay    313
t     306
x     300
o     269
f     227
n     195
w     182
j     181
az    175
aj    151
s     106
ap    103
h      75
d      73
al     67
v      36
af     35
ai     34
m      34
e      32
ba     27
at     25
a      21
ax     19
aq     18
i      18
am     18
u      17
aw     16
l      16
ad     14
k      11
au     11
b      11
r      10
as     10
bc      6
ao      4
c       3
q       2
aa      2
ac      1
g       1
ab      1
Name: count, dtype: int64

The dataset have lot of categories to deal with this , we cant use one hot encoding . However in such situation we can take 10 most frequent elements and perform one hot encoding on them and drop others.

In [97]:
df.X1.value_counts().sort_values(ascending=False).head(10)

X1
aa    833
s     598
b     592
l     590
v     408
r     251
i     203
a     143
c     121
o      82
Name: count, dtype: int64

In [98]:
top_10 = df.X1.value_counts().sort_values(ascending=False).head(10).index

In [99]:
top_10 = list(top_10)

In [100]:
top_10

['aa', 's', 'b', 'l', 'v', 'r', 'i', 'a', 'c', 'o']

In [101]:
for cats in top_10:
    df[cats] = np.where(df['X1'] == cats,1 , 0)

In [103]:
top_10.append('X1')

In [104]:
df[top_10]

      aa  s  b  l  v  r  i  a  c  o X1
0      0  0  0  0  1  0  0  0  0  0  v
1      0  0  0  0  0  0  0  0  0  0  t
2      0  0  0  0  0  0  0  0  0  0  w
3      0  0  0  0  0  0  0  0  0  0  t
4      0  0  0  0  1  0  0  0  0  0  v
...   .. .. .. .. .. .. .. .. .. .. ..
4204   0  1  0  0  0  0  0  0  0  0  s
4205   0  0  0  0  0  0  0  0  0  1  o
4206   0  0  0  0  1  0  0  0  0  0  v
4207   0  0  0  0  0  1  0  0  0  0  r
4208   0  0  0  0  0  1  0  0  0  0  r

[4209 rows x 11 columns]